# Считайте натуральное число n.
#
# Выведите на печать все числа от 0 до n, включительно, каждое с новой строки
#
# Sample Input:
#
# 3
# Sample Output:
#
# 0
# 1
# 2
# 3

n = int(input())
i = 0
while i <= n:
    print(i)
    i += 1
