# Print

# Выведите на печать строку "Hello, Stepik & Coursera!" (без кавычек)

print("Hello, Stepik & Coursera!")
