# Приведение типов

# В этой задаче считайте 2 строки. Каждая содержит целое число.
#
# Найдите сумму чисел (не забудьте привести числа к целому типу).
#
# Ответом будет так же целое число.
#
#
# P.S. проведите эксперимент и сложите эти 2 строки, не приводя их к целым числам.
#
# Sample Input:
#
# 4
# 11
# Sample Output:
#
# 15

n1 = int(input())
n2 = int(input())
print(n1 + n2)
