# Целая часть от деления
#
# Считайте 2 числа, каждое с новой строки.
#
# Найдите целую часть от деления первого на второе.
#
# Sample Input 1:
#
# 8
# 2
# Sample Output 1:
#
# 4
# Sample Input 2:
#
# 16
# 3
# Sample Output 2:
#
# 5

a = int(input())
b = int(input())
print(a // b)
